; Програмний модуль стартового файлу StartUp_1
; Визначити змінну "Розмір стека" (1 Кбайт)
Stack_Size EQU 0x00000400
; Оголосити секцію даних для розміщення стека системи
; без ініціалізації пам'яті, з атрибутом вирівнювання
; по 8 байтів
AREA STACK, NOINIT, READWRITE, ALIGN = 3
; Зарезервувати область пам'яті під стек
; з числом байтів Stack_Size
Stack_Mem SPACE Stack_Size; (1 Кбайт)
; Мітка вершини стека (авто-декрементний стек)
__initial_sp
; Vector Table
; Оголосити секцію для розміщення таблиці векторів
; переривань/винятків
; Для компонувальника визначається як область пам'яті
; даних RESET. Буде автоматично розміщена компонувальником
; на початку пам'яті програм
 AREA RESET, DATA, READONLY
; Оголосити параметри таблиці векторів - глобальними іменами
 EXPORT __Vectors
 EXPORT __Vectors_End
 EXPORT __Vectors_Size
; Ініціалізація векторів обробників
; переривань/винятків
__Vectors DCD __initial_sp ; Вершина стека - Top of Stack
DCD Reset_Handler ; Точка виходу в обробник винятку
; за скиданням процесора Reset Handler
DCD NMI_Handler ; Точка входу в обробник
; немасковного переривання NMI
; ...
; Далі за аналогією можуть бути оголошені й інші
; вектори обробників переривань/винятків
__Vectors_End
__Vectors_Size EQU __Vectors_End - __Vectors
; Оголошення кодової секції для розміщення
; підпрограм обробників переривань/винятків
 AREA |.text|, CODE, READONLY
; Обробник переривання за скиданням процесора Reset
Reset_Handler PROC
; Оголосити процедуру Reset_Handler загальнодоступною
; Вона може бути перепрограмована в подальшому
; Тому - використовується опція WEAK ("Слабка мітка")
 EXPORT Reset_Handler [WEAK]
; Ініціалізація процесора (через регістр CONTROL)
; ...
; У даній версії стартового файлу не виконується
; Процесор буде працювати за замовчуванням
; в режимі потоку (Thread Mode)
; з привілейованим доступом до всіх ресурсів (Privilegied)
; з поки вимкненим співпроцесором FPU
; Передати керування програмі користувача MyProg
; Оголошення точки входу в програму користувача
; (Зовнішня мітка)
 IMPORT MyProg
; Псевдо-команда: завантажити адресу MyProg в регістр r0
 LDR r0, =MyProg ; r0 <- адреса точки входу
; Непряма передача керування програмі користувача
 BX r0 ; PC <- (r0)
 ENDP ; Кінець процедури Reset_Handler
; "Порожній" обробник немасковного переривання NMI ("шаблон")
NMI_Handler PROC
; Оголосити процедуру NMI_Handler загальнодоступною
; В подальшому може бути перепрограмована,
; використана опція WEAK ( "Слабка мітка")
 EXPORT NMI_Handler [WEAK]
; Зациклити програму обробника
 B .
 ENDP ; Кінець процедури NMI_Handler
; Вирівняти кодову секцію по 4-и байтовому слову
 ALIGN
; Кінець асемблерного тексту стартового модуля
END
